{
	"about": {
		"title": "Stanislav Kosorin",
		"description": "The about page of Stanislav Kosorin, describing his background, skills, and interests",
		"heading": "Welcome!",
		"intro": "My name is Stan and I'm a software engineer. I'm currently pursuing a Master's degree in Computer Science at the ",
		"tub": "Technical University of Berlin",
		"job": {
			"intro": "I am currently doing a Software Development Engineer (SDE) internship at ",
			"content": "AWS",
			"outro": ", working on a project with the Simple Storage Service (S3) team in Berlin."
		},
		"cv": {
			"intro": "You can check out more of what I've been up to on my ",
			"content": "interactive resume",
			"outro": "."
		},
		"projects": {
			"intro": "I have worked on various projects, including Google Summer of Code 2024. You can find more info on the ",
			"content": "projects page",
			"outro": "."
		},
		"sports": {
			"content": "During my free time, I like to do sports, such as working out at the gym, running, or swimming. I also have a passion for learning languages, currently focusing on Persian and Swedish."
		}
	},
	"blog": {
		"title": "Blog",
		"description": "The personal blog of Stanislav Kosorin, including articles about programming, web development, and other topics",
		"heading": "Blog"
	},
	"cv": {
		"title": "Resume",
		"description": "An interactive resume of Stanislav Kosorin, outlining his education, work experience, and skills",
		"download": "Download PDF",
		"content": [
			{
				"title": "Software Dev Engineer Intern",
				"company": "AWS",
				"date": "Mar 2025 - Sep 2025",
				"details": "Built an EMR cluster core capacity prediction system for the S3 Express One Zone metering service, deployed to production regions and cut metering costs by ~65% while keeping cluster runtimes predictable.",
				"urlLabel": "Visit the S3 XOZ website",
				"url": "https://aws.amazon.com/s3/storage-classes/express-one-zone/",
				"urlName": "aws.amazon.com/s3/storage-classes/express-one-zone/",
				"type": "work"
			},
			{
				"title": "Software Engineer",
				"company": "Cresta",
				"date": "Nov 2022 - Mar 2025",
				"details": "At Cresta, I supported the development of data integrations and pipelines, across the frontend (React) and backend (Go). I gained a solid understanding of cloud technologies, particularly AWS, and Infrastructure as Code using Terraform. I also developed CI/CD pipelines using GitHub Actions and a custom E2E testing framework using Playwright.",
				"urlLabel": "Visit Cresta's website",
				"url": "https://www.cresta.com",
				"urlName": "cresta.com",
				"type": "work"
			},
			{
				"title": "Software Engineer",
				"company": "PTX tech",
				"date": "Nov 2021 - Nov 2022",
				"details": "At PTX, I contributed to the development of a cutting-edge, real-time 3D detection system. Specifically, I designed an efficient, multi-threaded pipeline in C++ (Qt5 framework) to process 3D point clouds effectively. I also integrated a GPU-accelerated Simultaneous Localization and Mapping (SLAM) algorithm into the system. This successful integration resulted in a ~10x speedup in processing time.",
				"urlLabel": "Visit PTX's website",
				"url": "https://www.ptx-tech.de",
				"urlName": "ptx-tech.de",
				"type": "work"
			}
		]
	},
	"education": {
		"title": "Education",
		"description": "An interactive resume of Stanislav Kosorin, outlining his education, work experience, and skills",
		"download": "Download full resume as PDF",
		"content": [
			{
				"title": "M.Sc. Computer Science",
				"company": "Technische Universität Berlin",
				"date": "Apr 2024 - Present",
				"details": "I'm currently pursuing a Master's degree with a focus on distributed systems, networking, databases, blockchain and software engineering. My expected graduation date is fall 2026.",
				"urlLabel": "Visit the university website",
				"url": "https://www.tu.berlin",
				"urlName": "tu.berlin",
				"type": "education"
			},
			{
				"title": "B.Sc. Computer Science",
				"company": "Technische Universität Berlin",
				"date": "Oct 2020 - Apr 2024",
				"details": "During my bachelor studies, I gained a strong foundation in programming, algorithms, and software development, with a focus on solving complex problems and collaborating effectively in team environments. In my thesis, I explored the feasibility of proactive container migration on a simulated low-Earth orbit (LEO) edge environment. The entire thesis and source code are available on my GitHub.",
				"urlLabel": "Visit the university website",
				"url": "https://www.tu.berlin",
				"urlName": "tu.berlin",
				"type": "education"
			},
			{
				"title": "High School",
				"company": "Gymnázium Ladislava Sáru, Bratislava",
				"date": "2012 - 2020",
				"details": "I attended a general education high school (similar to Gymnasium in Germany), with a focus on languages (german in my case). I graduated with a 1.0 (best possible) grade on my final exam, with the focus subjects: mathematics, informatics, English and Slovak. In addition to forming some great memories, I gained a strong foundation in natural sciences as well as an introduction to programming. I also learned German and achieved a C1 language certificate, which was a free ticket to most universities in Germany.",
				"urlLabel": "School website (only in Slovak)",
				"url": "https://gymlsba.edupage.org/?lang=en",
				"urlName": "gymlsba.edupage.org",
				"type": "education"
			}
		]
	},
	"projects": {
		"title": "Projects",
		"description": "The projects page of Stanislav Kosorin, showcasing his personal and professional projects",
		"github": "Check out my GitHub profile for more projects",
		"content": [
			{
				"title": "Slovak Language Learning App",
				"company": "LearnSlovak.sk",
				"date": "2025",
				"details": "Since Duolingo doesn't offer Slovak, I decided to create my own app to help my girlfriend learn the language more easily. It's a full-stack project, with a Next.js frontend and a Python (Flask) backend. The app offers multiple lessons and a practice mode.",
				"urlLabel": "Try it out yourself",
				"url": "https://learnslovak.sk",
				"urlName": "learnslovak.sk",
				"type": "personal project"
			},
			{
				"title": "In-Browser HEIC to JPEG Converter",
				"company": "heic2jpeg.eu",
				"date": "2025",
				"details": "This tool allows you to convert iPhone HEIC images to JPEG directly in your browser, without uploading your files to a server. I built this because the existing tools either didn't allow batch conversion or required uploading images to a third-party server.",
				"urlLabel": "Try it out yourself",
				"url": "https://heic2jpeg.eu",
				"urlName": "heic2jpeg.eu",
				"type": "personal project"
			},
			{
				"title": "Google Summer of Code",
				"company": "P4 Language Consortium",
				"date": "2024",
				"details": "This project with the P4 Language Consortium aims to integrate P4-based load balancing into the Kubernetes ecosystem. I developed a custom CNI plugin that dynamically configures a BMv2 software switch to load balance traffic during an inter-pod container migration. I am currently in the process of running experiments using a Tofino 2 switch and testing on a multi-node Kubernetes cluster, all thanks to the INET lab at TU Berlin.",
				"urlLabel": "Check out the repository on GitHub",
				"url": "https://github.com/stano45/p4containerflow",
				"urlName": "github.com/stano45/p4containerflow",
				"type": "GSoC project"
			},
			{
				"title": "Bachelor's Thesis: Container Migration on LEO Edge",
				"company": "TU Berlin",
				"date": "2024",
				"details": "In my Bachelor's thesis, I explored the feasibility of proactive container migration in a simulated low-Earth orbit (LEO) edge environment. I developed a custom migration strategy and evaluated its performance in terms of latency, throughput, and resource utilization. The thesis and source code are available on my GitHub.",
				"urlLabel": "Check out the repository on GitHub",
				"url": "https://github.com/stano45/celestial-container-migration",
				"urlName": "github.com/stano45/celestial-container-migration",
				"type": "thesis project"
			},
			{
				"title": "Network Traffic Visualization Chrome Extension",
				"company": "net-mapper",
				"date": "2024",
				"details": "net-mapper is a Chrome extension that visualizes the global destinations of your internet traffic. The extension logs the IP addresses of all servers your browser communicates with and displays them on an interactive map, allowing you to see the physical locations of the servers hosting the websites you visit. Unfortunately, the extension is not available in the Chrome Web Store due to major changes in extension permissions, but if you're interested, you can check out the source code and run it locally.",
				"urlLabel": "Check out the repository on GitHub",
				"url": "https://github.com/stano45/net-mapper",
				"urlName": "github.com/stano45/net-mapper",
				"type": "personal project"
			},
			{
				"title": "Portfolio Website",
				"company": "kosorin.com",
				"date": "2023",
				"details": "You're currently looking at it! I built this website from scratch using React, Next.js, and Tailwind CSS. It's statically exported via Next.js and hosted by Github pages.",
				"urlLabel": "Check out the repository on GitHub",
				"url": "https://github.com/stano45/stano45.github.io",
				"urlName": "github.com/stano45/stano45.github.io",
				"type": "personal project"
			},
			{
				"title": "Rust Microservice Code Generator",
				"company": "TU Berlin",
				"date": "2023",
				"details": "Crustagen is a Rust code generator that takes AsyncAPI specifications as input and generates Rust code along with all the required dependencies and auto-generated documentation. It's designed to be an efficient tool to convert AsyncAPI specs into Rust projects ready to build and run.",
				"urlLabel": "Check out the repository on GitHub",
				"url": "https://github.com/Programmierpraktikum-MVA/AsyncAPI",
				"urlName": "github.com/Programmierpraktikum-MVA/AsyncAPI",
				"type": "university project"
			},
			{
				"title": "Distributed Key-Value Store in Rust",
				"company": "hit-or-miss",
				"date": "2023",
				"details": "hit-or-miss is a distributed key-value store using the master-slave architecture. The slave is selected based on a consistent hashing algorithm, and the master is responsible for replication and failure detection. The project is written in Rust and uses the Tokio runtime for asynchronous I/O operations. This is not a production-ready system, but rather a learning project to understand distributed systems and Rust.",
				"urlLabel": "Check out the repository on GitHub",
				"url": "https://github.com/stano45/hit-or-miss",
				"urlName": "github.com/stano45/hit-or-miss",
				"type": "personal project"
			}
		]
	},
	"contact": {
		"title": "Contact",
		"description": "The contact page of Stanislav Kosorin, including his email address and social media profiles",
		"linkedin": "Connect with me on LinkedIn 🌍",
		"github": "Check out my projects on Github 🐱‍💻",
		"email": "Send me an email 📧"
	}
}
