{
	"about": {
		"title": "Stanislav Kosorin",
		"description": "Stránka o Stanislavovi Kosorinovi, opisujúca jeho pozadie, schopnosti a záujmy",
		"heading": "Vitaj!",
		"intro": "Volám sa Stano a som softvérový inžinier. Momentálne študujem masters informatiky na ",
		"tub": "Technickej univerzite v Berlíne",
		"job": {
			"intro": "Momentálne robím stáž ako Software Development Engineer (SDE) v ",
			"content": "AWS",
			"outro": ", kde pracujem na projekte so Simple Storage Service (S3) tímom v Berlíne."
		},
		"work": {
			"intro": "Ak chceš vedieť viac o mojej doterajšej práci, pozri si ",
			"content": "stránku Práca",
			"outro": "."
		},
		"projects": {
			"intro": "Taktiež mám za sebou viacero projektov, ako napríklad Google Summer of Code 2024. Tieto projekty nájdeš na ",
			"content": " stránke Projekty",
			"outro": "."
		},
		"sports": {
			"content": "Okrem programovania vo voľnom čase rád športujem. Rád chodím do posilky, behám a plávam. Tiež ma bavia jazyky, práve sa učím po perzsky a švédsky."
		}
	},
	"blog": {
		"title": "Blog",
		"description": "Blog Stanislav Kosorin, kde sa môžete dozvedieť viac o jeho záujmoch, zážitkoch a nápadoch",
		"heading": "Blog"
	},
	"work": {
		"title": "Práca",
		"description": "Interaktívny životopis Stanislava Kosorina, v ktorom sú popísané jeho vzdelanie, pracovné skúsenosti a zručnosti",
		"download": "Stianhuť PDF",
		"content": [
			{
				"title": "Software Dev Engineer Intern",
				"company": "AWS",
				"date": "mar 2025 - sep 2025",
				"details": "Vyvinul som EMR Cluster Core Capacity Prediction System pre S3 Express One Zone Metering Service, nasadený v produkčných regiónoch, ktorý znížil metering náklady o približne 65 % a zároveň zachoval predvídateľné cluster runtimes.",
				"urlLabel": "Pozri si stránku S3 XOZ",
				"url": "https://aws.amazon.com/s3/storage-classes/express-one-zone/",
				"urlName": "aws.amazon.com/s3/storage-classes/express-one-zone/",
				"type": "stáž"
			},
			{
				"title": "Softvérový inžinier",
				"company": "Cresta",
				"date": "nov 2022 - mar 2025",
				"details": "V spoločnosti Cresta som podporoval vývoj dátových integrácií a pipelines, na frontende (React) aj backende (Go). Získal som pevné znalosti cloudových technológií, najmä AWS a Infrastructure as Code pomocou Terraformu. Vyvinul som tiež CI/CD pipelines pomocou GitHub Actions a pomohol vyvinúť E2E testing framework s pomocou Playwrightu.",
				"urlLabel": "Pozri si webstránku Cresta",
				"url": "https://www.cresta.com",
				"urlName": "cresta.com",
				"type": "študentská práca"
			},
			{
				"title": "Softvérový inžinier",
				"company": "PTX tech",
				"date": "nov 2021 - nov 2022",
				"details": "V PTX tech som prispel k vývoju pokročilého 3D detekčného systému v reálnom čase. Konkrétne som navrhol efektívnu, viacvláknovú pipeline v C++ (Qt5 framework) na spracovanie 3D bodových oblakov. Tiež som integroval GPU-akcelerovaný algoritmus pre simultánnu lokalizáciu a mapovanie (SLAM) do systému. Táto úspešná integrácia viedla celkovo k približne 10-násobnému zrýchleniu.",
				"urlLabel": "Pozri si webstránku PTX",
				"url": "https://www.ptx-tech.de",
				"urlName": "ptx-tech.de",
				"type": "študentská práca"
			}
		]
	},
	"education": {
		"title": "Vzdelanie",
		"description": "Interaktívny životopis Stanislava Kosorina, v ktorom sú popísané jeho vzdelanie, pracovné skúsenosti a zručnosti",
		"download": "Stianhuť PDF",
		"content": [
			{
				"title": "M.Sc. Informatika",
				"company": "Technische Universität Berlin",
				"date": "apr 2024 - dnes",
				"details": "V súčasnosti študujem magistra so zameraním na distribuované systémy, siete, databázy, blockchain a softvérové inžinierstvo. Očakávaný dátum ukončenia je na jeseň 2026.",
				"urlLabel": "Pozri si webstránku univerzity",
				"url": "https://www.tu.berlin",
				"urlName": "tu.berlin",
				"type": "magisterské štúdium"
			},
			{
				"title": "Bakalárska práca: Migrácia kontajnerov na LEO Edge",
				"company": "TU Berlin",
				"date": "2024",
				"details": "Vo svojej bakalárskej práci som skúmal uskutočniteľnosť proaktívnej migrácie kontajnerov v simulovanom prostredí low-Earth orbit (LEO) edge. Vyvinul som vlastnú migračnú stratégiu a hodnotil jej výkon z hľadiska latencie, priepustnosti a využitia zdrojov. Práca a zdrojový kód sú k dispozícii na mojom GitHube.",
				"urlLabel": "Pozri si projekt na GitHube",
				"url": "https://github.com/stano45/celestial-container-migration",
				"urlName": "github.com/stano45/celestial-container-migration",
				"type": "bakalárska práca"
			},
			{
				"title": "B.Sc. Informatika",
				"company": "Technische Universität Berlin",
				"date": "okt 2020 - apr 2024",
				"details": "Počas bakalárskeho štúdia som získal solídne základy v programovaní, algoritmoch a vývoji softvéru, so zameraním na riešenie zložitých problémov a efektívnu tímovú spoluprácu. Vo svojej diplomovej práci som skúmal uskutočniteľnosť proaktívnej migrácie kontajnerov v simulovanom LEO edge prostredí. Celá práca a zdrojový kód sú dostupné na mojom GitHub-e.",
				"urlLabel": "Pozri si webstránku univerzity",
				"url": "https://www.tu.berlin",
				"urlName": "tu.berlin",
				"type": "bakalárske štúdium"
			},
			{
				"title": "Gymnázium",
				"company": "Gymnázium Ladislava Sáru, Bratislava",
				"date": "2012 - 2020",
				"details": "Chodil som na všeobecné gymnázium so zameraním na jazyky. Maturoval som z matematiky, informatiky, angličtiny a slovenčiny, a dostal známku 1. Okrem pekných spomienok som získal pevné základy v prírodných vedách a úvod do programovania. Tiež som získal certifikát C1 z nemčiny, čo mi umožnilo študovať na väčšine nemeckých univerzít.",
				"urlLabel": "Pozri si webstránku školy (iba v slovenčine)",
				"url": "https://gymlsba.edupage.org/?lang=en",
				"urlName": "gymlsba.edupage.org",
				"type": "gymnázium"
			}
		]
	},
	"projects": {
		"title": "Projekty",
		"description": "Stránka projektov Stanislava Kosorina, ktorá predstavuje jeho osobné aj profesionálne projekty",
		"github": "Pozri si môj GitHub profil pre ďalšie projekty",
		"content": [
			{
				"title": "Aplikácia na učenie slovenčiny",
				"company": "LearnSlovak.sk",
				"date": "2025",
				"details": "Keďže Duolingo neponúka slovenčinu, rozhodol som sa vytvoriť vlastnú aplikáciu a pomôcť mojej priateľke rýchlejšie sa naučiť po slovensky. Je to full-stack projekt s Next.js frontendom a Python (Flask) backendom. Aplikácia ponúka viacero lekcií a cvičný režim.",
				"urlLabel": "Vyskúšaj appku tu",
				"url": "https://learnslovak.sk",
				"urlName": "learnslovak.sk",
				"type": "osobný projekt"
			},
			{
				"title": "Konvertor HEIC na JPEG v prehliadači",
				"company": "heic2jpeg.eu",
				"date": "2025",
				"details": "Tento nástroj vám umožňuje konvertovať iPhone HEIC obrázky na JPEG priamo v prehliadači, bez nutnosti nahrávať súbory na server. Vytvoril som ho, pretože existujúce nástroje buď nepodporovali batch konverziu, alebo vyžadovali nahrávanie obrázkov na server.",
				"urlLabel": "Vyskúšaj stránku tu",
				"url": "https://heic2jpeg.eu",
				"urlName": "heic2jpeg.eu",
				"type": "osobný projekt"
			},
			{
				"title": "Google Summer of Code",
				"company": "P4 Language Consortium",
				"date": "2024",
				"details": "Tento projekt v spolupráci s P4 Language Consortium si kladie za cieľ integrovať P4 load balancer do ekosystému Kubernetes. Vyvinul som CNI plugin, ktorý dynamicky konfiguruje softvérový prepínač BMv2 počas migrácie kontajnerov medzi podmi. Momentálne experimentujem s prepínačom Tofino 2 a testujem v Kubernetes klasteri s viacerými nodes, všetko vďaka INET laboratóriu na TU Berlin.",
				"urlLabel": "Pozri si projekt na GitHube",
				"url": "https://github.com/stano45/p4containerflow",
				"urlName": "github.com/stano45/p4containerflow",
				"type": "GSoC projekt"
			},
			{
				"title": "Portfóliová webstránka",
				"company": "kosorin.com",
				"date": "2023",
				"details": "Práve sa na ňu pozeráš! Túto webstránku som vytvoril od základov pomocou React, Next.js a Tailwind CSS. Je staticky exportovaná cez Next.js a hostovaná na Githube Pages.",
				"urlLabel": "Pozri si projekt na Githube",
				"url": "https://github.com/stano45/stano45.github.io",
				"urlName": "github.com/stano45/stano45.github.io",
				"type": "osobný projekt"
			},
			{
				"title": "Rust generátor kódu pre mikroslužby",
				"company": "TU Berlin",
				"date": "2023",
				"details": "Crustagen je generátor kódu v jazyku Rust, ktorý berie ako vstup AsyncAPI špecifikácie a generuje Rust kód spolu so všetkými potrebnými dependencies a automaticky generovanou dokumentáciou. Je navrhnutý ako efektívny nástroj na konverziu AsyncAPI špecifikácií do Rust projektov, ktoré sú pripravené na zostavenie a spustenie.",
				"urlLabel": "Pozri si projekt na Githube",
				"url": "https://github.com/Programmierpraktikum-MVA/AsyncAPI",
				"urlName": "github.com/Programmierpraktikum-MVA/AsyncAPI",
				"type": "univerzitný projekt"
			},
			{
				"title": "Distribuované key-value úložisko v Rust",
				"company": "hit-or-miss",
				"date": "2023",
				"details": "hit-or-miss je distribuované key-value úložisko využívajúce architektúru master-slave. Slave je vybraný na základe algoritmu konzistentného hashovania a master je zodpovedný za replikáciu a detekciu chýb. Projekt je napísaný v jazyku Rust a používa Tokio runtime pre asynchrónne I/O operácie. Nejde o systém pripravený na produkciu, ale skôr o vzdelávací projekt na pochopenie distribuovaných systémov a Rust.",
				"urlLabel": "Pozri si projekt na Githube",
				"url": "https://github.com/stano45/hit-or-miss",
				"urlName": "github.com/stano45/hit-or-miss",
				"type": "osobný projekt"
			}
		]
	},
	"contact": {
		"title": "Kontakt",
		"description": "Kontakt na Stanislava Kosorina, jeho sociálne siete a email",
		"linkedin": "Spoj sa so mnou na LinkedIn 🌍",
		"github": "Pozri si moje projekty na GitHube 🐱‍💻",
		"email": "Pošli mi mail 📧"
	}
}
