{
	"about": {
		"title": "Stanislav Kosorin",
		"description": "Die persönliche Website von Stanislav Kosorin, inklusive Informationen über seine Arbeit, Projekte und Interessen",
		"heading": "Wilkommen!",
		"intro": "Ich bin Stan und beschäftige mich mit der Softwareentwicklung. Ich studiere Master Informatik an der ",
		"tub": "Technischen Universität Berlin",
		"cresta": {
			"intro": "Neben meinem Studium helfe ich ",
			"content": "Cresta",
			"outro": " dabei, Callcenter mit AI zu revolutionieren. Konkret arbeite ich als Full Stack Entwickler, und nutze hauptsächlich React, Go und AWS."
		},
		"cv": {
			"intro": "Mehr über meine bisherige Erfahrung findet man in meinem ",
			"content": "interaktiven Lebenslauf",
			"outro": "."
		},
		"projects": {
			"intro": "Ich habe an verschiedenen Projekten gearbeitet, wie z. B. Google Summer of Code 2024. Mehr Informationen dazu gibt es auf der ",
			"content": " Projekte-Seite",
			"outro": "."
		},
		"sports": {
			"content": "In meiner Freizeit mache ich gerne Sport, zum Beispiel trainiere ich im Fitnessstudio, laufe oder schwimme. Außerdem interessiere ich mich für Sprachen und lerne derzeit Persisch und Schwedisch."
		}
	},
	"blog": {
		"title": "Blog",
		"description": "Der Blog von Stanislav Kosorin, inklusive Beiträge über seine Arbeit, Projekte und Interessen",
		"heading": "Blog"
	},
	"cv": {
		"title": "Lebenslauf",
		"description": "Ein interaktiver Lebenslauf von Stanislav Kosorin, der seine Ausbildung, Berufserfahrung und Fähigkeiten beschreibt",
		"download": "PDF herunterladen",
		"content": [
			{
				"title": "M.Sc. Informatik",
				"company": "Technische Universität Berlin",
				"date": "Apr 2024 - aktuell",
				"details": "Ich absolviere derzeit ein Masterstudium mit Schwerpunkt auf verteilten Systemen, Netzwerken, Datenbanken, Blockchain und Software Engineering. Mein voraussichtlicher Abschluss ist im Herbst 2026.",
				"urlLabel": "Besuche die Website der Universität",
				"url": "https://www.tu.berlin",
				"urlName": "tu.berlin",
				"type": "Bildung"
			},
			{
				"title": "Softwareentwickler",
				"company": "Cresta",
				"date": "Nov 2022 - aktuell",
				"details": "Bei Cresta habe ich die Entwicklung von Datenintegrationen und Pipelines unterstützt, sowohl im Frontend (React) als auch im Backend (Go). Ich habe fundierte Kenntnisse in Cloud-Technologien, insbesondere AWS, sowie in Infrastructure as Code mit Terraform erworben. Außerdem habe ich CI/CD-Pipelines mit GitHub Actions und einem eigenen End-to-End-Testframework mit Playwright entwickelt.",
				"urlLabel": "Besuche die Website von Cresta",
				"url": "https://www.cresta.com",
				"urlName": "cresta.com",
				"type": "Arbeit"
			},
			{
				"title": "Softwareentwickler",
				"company": "PTX tech",
				"date": "Nov 2021 - Nov 2022",
				"details": "Bei PTX habe ich an der Entwicklung eines fortschrittlichen Echtzeit-3D-Erkennungssystems mitgewirkt. Konkret habe ich eine effiziente, multithreaded Pipeline in C++ (Qt5-Framework) entworfen, um 3D-Punktwolken effektiv zu verarbeiten. Zudem habe ich einen GPU-beschleunigten SLAM-Algorithmus (Simultaneous Localization and Mapping) in das System integriert. Diese Integration führte zu einer etwa 10-fachen Beschleunigung der Verarbeitungszeit.",
				"urlLabel": "Besuche die Website von PTX",
				"url": "https://www.ptx-tech.de",
				"urlName": "ptx-tech.de",
				"type": "Arbeit"
			},
			{
				"title": "B.Sc. Informatik",
				"company": "Technische Universität Berlin",
				"date": "Okt 2020 - Apr 2024",
				"details": "Während meines Bachelorstudiums habe ich mir eine solide Grundlage in Programmierung, Algorithmen und Softwareentwicklung erarbeitet, mit Schwerpunkt auf der Lösung komplexer Probleme und effektiver Teamarbeit. In meiner Abschlussarbeit habe ich die Machbarkeit einer proaktiven Container-Migration in einer simulierten LEO-Edge-Umgebung (Low-Earth Orbit) untersucht. Die vollständige Arbeit sowie der Quellcode sind auf meinem GitHub verfügbar.",
				"urlLabel": "Besuche die Website der Universität",
				"url": "https://www.tu.berlin",
				"urlName": "tu.berlin",
				"type": "Bildung"
			},
			{
				"title": "Gymnasium",
				"company": "Gymnázium Ladislava Sáru, Bratislava",
				"date": "2012 - 2020",
				"details": "Ich besuchte ein allgemeinbildendes Gymnasium (vergleichbar mit dem Gymnasium in Deutschland) mit Schwerpunkt auf Sprachen (bei mir vor allem Deutsch). Ich schloss meine Schulzeit mit der Note 1,0 (beste mögliche Note) ab, wobei die Schwerpunkte Mathematik, Informatik, Englisch und Slowakisch lagen. Neben vielen schönen Erinnerungen erwarb ich auch eine solide Grundlage in den Naturwissenschaften sowie eine Einführung in die Programmierung. Außerdem lernte ich Deutsch und erwarb ein C1-Sprachzertifikat, das mir den Zugang zu den meisten Universitäten in Deutschland ermöglichte.",
				"urlLabel": "Schulwebsite (nur auf Slowakisch)",
				"url": "https://gymlsba.edupage.org/?lang=de",
				"urlName": "gymlsba.edupage.org",
				"type": "Bildung"
			}
		]
	},
	"projects": {
		"title": "Projekte",
		"description": "Die Projekte-Seite von Stanislav Kosorin, die seine persönlichen und beruflichen Projekte präsentiert",
		"github": "Schau dir mein GitHub-Profil für weitere Projekte an",
		"content": [
			{
				"title": "Slowakische Sprachlern-App",
				"company": "LearnSlovak.sk",
				"date": "2025",
				"details": "Da Duolingo Slowakisch nicht anbietet, habe ich mich dazu entschlossen, eine eigene App zu erstellen, um meiner Freundin das Erlernen der Sprache zu erleichtern. Es ist ein Full-Stack-Projekt, mit einem Next.js-Frontend und einem Python (Flask)-Backend. Die App bietet mehrere Lektionen und einen Übungsmodus.",
				"urlLabel": "Probier es selbst aus, es ist komplett kostenlos",
				"url": "https://learnslovak.sk",
				"urlName": "learnslovak.sk",
				"type": "persönliches Projekt"
			},
			{
				"title": "HEIC-zu-JPEG-Konverter im Browser",
				"company": "heic2jpeg.eu",
				"date": "2025",
				"details": "Dieses Tool ermöglicht es Ihnen, iPhone HEIC-Bilder direkt in Ihrem Browser in JPEG umzuwandeln, ohne Ihre Dateien auf einen Server hochladen zu müssen. Ich habe es entwickelt, weil die bestehenden Tools entweder keine Batch-Konvertierung erlaubten oder das Hochladen von Bildern auf einen Drittanbieterserver erforderten.",
				"urlLabel": "Probier es selbst aus",
				"url": "https://heic2jpeg.eu",
				"urlName": "heic2jpeg.eu",
				"type": "persönliches Projekt"
			},
			{
				"title": "Google Summer of Code",
				"company": "P4 Language Consortium",
				"date": "2024",
				"details": "Dieses Projekt mit dem P4 Language Consortium zielt darauf ab, P4-basiertes Load Balancing in das Kubernetes-Ökosystem zu integrieren. Ich habe ein maßgeschneidertes CNI-Plugin entwickelt, das einen BMv2 Software-Switch dynamisch konfiguriert, um den Datenverkehr während einer inter-Pod-Container-Migration auszugleichen. Derzeit führe ich Experimente mit einem Tofino 2 Switch durch und teste in einem Kubernetes-Cluster mit mehreren Knoten, dank des INET-Labors an der TU Berlin.",
				"urlLabel": "Schau dir das Repository auf GitHub an",
				"url": "https://github.com/stano45/p4containerflow",
				"urlName": "github.com/stano45/p4containerflow",
				"type": "GSoC-Projekt"
			},
			{
				"title": "Bachelorarbeit: Container-Migration am LEO Edge",
				"company": "TU Berlin",
				"date": "2024",
				"details": "In meiner Bachelorarbeit habe ich die Machbarkeit proaktiver Container-Migration in einer simulierten Low-Earth-Orbit (LEO) Edge-Umgebung untersucht. Ich habe eine maßgeschneiderte Migrationsstrategie entwickelt und ihre Leistung hinsichtlich Latenz, Durchsatz und Ressourcennutzung evaluiert. Die Arbeit und der Quellcode sind auf meinem GitHub verfügbar.",
				"urlLabel": "Sieh dir das Repository auf GitHub an",
				"url": "https://github.com/stano45/celestial-container-migration",
				"urlName": "github.com/stano45/celestial-container-migration",
				"type": "Bachelorarbeit"
			},
			{
				"title": "Chrome-Erweiterung zur Visualisierung des Netzwerkverkehrs",
				"company": "net-mapper",
				"date": "2024",
				"details": "net-mapper ist eine Chrome-Erweiterung, die die globalen Ziele deines Internetverkehrs visualisiert. Die Erweiterung protokolliert die IP-Adressen aller Server, mit denen dein Browser kommuniziert, und stellt sie auf einer interaktiven Karte dar, sodass du die physischen Standorte der Server, die die von dir besuchten Websites hosten, sehen kannst. Leider ist die Erweiterung aufgrund wesentlicher Änderungen in den Erweiterungsberechtigungen nicht im Chrome Web Store verfügbar, aber wenn du interessiert bist, kannst du dir den Quellcode ansehen und sie lokal ausführen.",
				"urlLabel": "Sieh dir das Repository auf GitHub an",
				"url": "https://github.com/stano45/net-mapper",
				"urlName": "github.com/stano45/net-mapper",
				"type": "persönliches Projekt"
			},
			{
				"title": "Portfolio-Website",
				"company": "kosorin.com",
				"date": "2023",
				"details": "Du siehst sie gerade! Ich habe diese Website von Grund auf mit React, Next.js und Tailwind CSS gebaut. Sie wird statisch via Next.js exportiert und von GitHub Pages gehostet.",
				"urlLabel": "Sieh dir das Repository auf GitHub an",
				"url": "https://github.com/stano45/stano45.github.io",
				"urlName": "github.com/stano45/stano45.github.io",
				"type": "persönliches Projekt"
			},
			{
				"title": "Rust Microservice-Codegenerator",
				"company": "TU Berlin",
				"date": "2023",
				"details": "Crustagen ist ein Rust-Codegenerator, der AsyncAPI-Spezifikationen als Eingabe nimmt und Rust-Code zusammen mit allen erforderlichen Abhängigkeiten und automatisch generierter Dokumentation erzeugt. Er wurde als effizientes Tool entwickelt, um AsyncAPI-Spezifikationen in Rust-Projekte umzuwandeln, die bereit sind, gebaut und ausgeführt zu werden.",
				"urlLabel": "Sieh dir das Repository auf GitHub an",
				"url": "https://github.com/Programmierpraktikum-MVA/AsyncAPI",
				"urlName": "github.com/Programmierpraktikum-MVA/AsyncAPI",
				"type": "Universitätsprojekt"
			},
			{
				"title": "Verteilter Key-Value-Store in Rust",
				"company": "hit-or-miss",
				"date": "2023",
				"details": "hit-or-miss ist ein verteilter Key-Value-Store, der auf einer Master-Slave-Architektur basiert. Der Slave wird mittels eines konsistenten Hashing-Algorithmus ausgewählt, während der Master für Replikation und Fehlererkennung verantwortlich ist. Das Projekt ist in Rust geschrieben und nutzt den Tokio-Runtime für asynchrone I/O-Operationen. Es handelt sich hierbei nicht um ein produktionsreifes System, sondern um ein Lernprojekt, um verteilte Systeme und Rust besser zu verstehen.",
				"urlLabel": "Sieh dir das Repository auf GitHub an",
				"url": "https://github.com/stano45/hit-or-miss",
				"urlName": "github.com/stano45/hit-or-miss",
				"type": "persönliches Projekt"
			}
		]
	},
	"contact": {
		"title": "Kontakt",
		"description": "Kontaktinformationen für Stanislav Kosorin, inklusive seiner E-Mail-Adresse und Telefonnummer",
		"linkedin": "Verbinde dich mit mir auf LinkedIn 🌍",
		"github": "Schau dir meine Projekte auf Github an 🐱‍💻",
		"email": "Schick mir eine E-Mail 📧"
	}
}
