{
	"about": {
		"title": "Stanislav Kosorin",
		"description": "Om-sidan för Stanislav Kosorin, beskriver hans bakgrund, färdigheter och intressen",
		"heading": "Välkommen!",
		"intro": "Mitt namn är Stan och jag är mjukvaruingenjör. Jag studerar för närvarande en masterexamen i datavetenskap vid ",
		"tub": "Tekniska Universitetet i Berlin",
		"cresta": {
			"intro": "Förutom att studera hjälper jag ",
			"content": "Cresta",
			"outro": " att revolutionera kontaktcentra med AI. Specifikt är jag fullstackutvecklare och arbetar främst med React, Go och AWS."
		},
		"cv": {
			"intro": "Du kan kolla in mer av vad jag har gjort på mitt ",
			"content": "interaktiva CV",
			"outro": "."
		},
		"projects": {
			"intro": "Jag har arbetat med olika projekt, inklusive Google Summer of Code 2024. Du kan hitta mer information på ",
			"content": "projektsidan",
			"outro": "."
		},
		"sports": {
			"content": "Under min fritid gillar jag att träna, springa eller simma. Jag har också ett intresse för att lära mig språk, och fokuserar för närvarande på persiska och svenska."
		}
	},
	"blog": {
		"title": "Blogg",
		"description": "Stanislav Kosorins blogg, där du kan lära dig mer om hans intressen, upplevelser och idéer",
		"heading": "Blogg"
	},
	"cv": {
		"title": "CV",
		"description": "En interaktiv CV för Stanislav Kosorin, som beskriver hans utbildning, arbetslivserfarenhet och färdigheter",
		"legend": {
			"work": "Arbetslivserfarenhet",
			"education": "Utbildning",
			"project": "Personligt projekt"
		},
		"download": "Ladda ner PDF",
		"content": [
			{
				"title": "M.Sc. Datavetenskap",
				"company": "Technische Universität Berlin",
				"date": "apr 2024 - pågående",
				"details": "Jag studerar för närvarande en masterexamen med inriktning på distribuerade system, nätverk, databaser, blockchain och mjukvaruutveckling. Jag räknar med att ta examen hösten 2026.",
				"urlLabel": "Besök universitetets webbplats",
				"url": "https://www.tu.berlin",
				"urlName": "tu.berlin",
				"type": "utbildning"
			},
			{
				"title": "Mjukvaruutvecklare",
				"company": "Cresta",
				"date": "nov 2022 - pågående",
				"details": "På Cresta bidrog jag till utvecklingen av dataintegrationer och pipelines, både för frontend (React) och backend (Go). Jag skaffade mig en god förståelse för molnteknologier, särskilt AWS, samt för Infrastructure as Code med Terraform. Jag utvecklade även CI/CD-pipelines med GitHub Actions och ett eget E2E-testframework med Playwright.",
				"urlLabel": "Besök Crestas webbplats",
				"url": "https://www.cresta.com",
				"urlName": "cresta.com",
				"type": "arbete"
			},
			{
				"title": "Mjukvaruutvecklare",
				"company": "PTX tech",
				"date": "nov 2021 - nov 2022",
				"details": "På PTX bidrog jag till utvecklingen av ett avancerat, realtids-3D-upptäcktsystem. Specifikt designade jag en effektiv, multitrådad pipeline i C++ (Qt5-ramverket) för att bearbeta 3D-punktmoln på ett effektivt sätt. Jag integrerade också en GPU-accelererad SLAM-algoritm (Simultaneous Localization and Mapping) i systemet. Denna integration resulterade i en ungefär 10-faldig ökning av bearbetningshastigheten.",
				"urlLabel": "Besök PTX:s webbplats",
				"url": "https://www.ptx-tech.de",
				"urlName": "ptx-tech.de",
				"type": "arbete"
			},
			{
				"title": "B.Sc. Datavetenskap",
				"company": "Technische Universität Berlin",
				"date": "okt 2020 - apr 2024",
				"details": "Under mina kandidatstudier fick jag en solid grund inom programmering, algoritmer och mjukvaruutveckling, med fokus på att lösa komplexa problem och samarbeta effektivt i team. I mitt examensarbete undersökte jag möjligheten till proaktiv container-migration i en simulerad LEO-edge-miljö (Low-Earth Orbit). Hela arbetet samt källkoden finns tillgänglig på min GitHub.",
				"urlLabel": "Besök universitetets webbplats",
				"url": "https://www.tu.berlin",
				"urlName": "tu.berlin",
				"type": "arbete"
			},
			{
				"title": "Gymnasium",
				"company": "Gymnázium Ladislava Sáru, Bratislava",
				"date": "2012 - 2020",
				"details": "Jag gick på en allmän gymnasieskola (liknande det tyska gymnasiet) med inriktning på språk (tyska i mitt fall). Jag tog studenten med betyget 1,0 (bästa möjliga) på slutprovet, med huvudämnena matematik, informatik, engelska och slovakiska. Förutom många fina minnen fick jag en gedigen grund inom naturvetenskap samt en introduktion till programmering. Jag lärde mig också tyska och erhöll ett C1-språkcertifikat, vilket var ett gratis inträde till de flesta universitet i Tyskland.",
				"urlLabel": "Skolans webbplats (endast på slovakiska)",
				"url": "https://gymlsba.edupage.org/?lang=en",
				"urlName": "gymlsba.edupage.org",
				"type": "utbildning"
			}
		]
	},

	"contact": {
		"title": "Kontakt",
		"description": "Kontaktinformation för Stanislav Kosorin, hans sociala nätverk och e-post",
		"linkedin": "Anslut till mig på LinkedIn 🌍",
		"github": "Kolla in mina projekt på Github 🐱‍💻",
		"email": "Skicka mig ett e-postmeddelande 📧"
	}
}
