{
	"about": {
		"title": "Stanislav Kosorin",
		"description": "Die persönliche Website von Stanislav Kosorin, inklusive Informationen über seine Arbeit, Projekte und Interessen",
		"heading": "Wilkommen!",
		"intro": "Ich bin Stan und beschäftige mich mit der Softwareentwicklung. Ich studiere Master Informatik an der ",
		"tub": "Technischen Universität Berlin",
		"cresta": {
			"intro": "Neben meinem Studium helfe ich ",
			"content": "Cresta",
			"outro": " dabei, Callcenter mit AI zu revolutionieren. Konkret arbeite ich als Full Stack Entwickler, und nutze hauptsächlich React, Go und AWS."
		},
		"cv": {
			"intro": "Mehr über meine bisherige Erfahrung findet man in meinem ",
			"content": "interaktiven Lebenslauf",
			"outro": "."
		},
		"projects": {
			"intro": "Ich habe an verschiedenen Projekten gearbeitet, wie z. B. Google Summer of Code 2024. Mehr Informationen dazu gibt es auf der ",
			"content": " Projekte-Seite",
			"outro": "."
		},
		"sports": {
			"content": "In meiner Freizeit mache ich gerne Sport, zum Beispiel trainiere ich im Fitnessstudio, laufe oder schwimme. Außerdem interessiere ich mich für Sprachen und lerne derzeit Persisch und Schwedisch."
		}
	},
	"blog": {
		"title": "Blog",
		"description": "Der Blog von Stanislav Kosorin, inklusive Beiträge über seine Arbeit, Projekte und Interessen",
		"heading": "Blog"
	},
	"cv": {
		"title": "Lebenslauf",
		"description": "Ein interaktiver Lebenslauf von Stanislav Kosorin, der seine Ausbildung, Berufserfahrung und Fähigkeiten beschreibt",
		"legend": {
			"Arbeit": "Berufserfahrung",
			"Bildung": "Ausbildung",
			"project": "Persönliches Projekt"
		},
		"download": "PDF herunterladen",
		"content": [
			{
				"title": "M.Sc. Informatik",
				"company": "Technische Universität Berlin",
				"date": "Apr 2024 - aktuell",
				"details": "Ich absolviere derzeit ein Masterstudium mit Schwerpunkt auf verteilten Systemen, Netzwerken, Datenbanken, Blockchain und Software Engineering. Mein voraussichtlicher Abschluss ist im Herbst 2026.",
				"urlLabel": "Besuche die Website der Universität",
				"url": "https://www.tu.berlin",
				"urlName": "tu.berlin",
				"type": "Bildung"
			},
			{
				"title": "Softwareentwickler",
				"company": "Cresta",
				"date": "Nov 2022 - aktuell",
				"details": "Bei Cresta habe ich die Entwicklung von Datenintegrationen und Pipelines unterstützt, sowohl im Frontend (React) als auch im Backend (Go). Ich habe fundierte Kenntnisse in Cloud-Technologien, insbesondere AWS, sowie in Infrastructure as Code mit Terraform erworben. Außerdem habe ich CI/CD-Pipelines mit GitHub Actions und einem eigenen End-to-End-Testframework mit Playwright entwickelt.",
				"urlLabel": "Besuche die Website von Cresta",
				"url": "https://www.cresta.com",
				"urlName": "cresta.com",
				"type": "Arbeit"
			},
			{
				"title": "Softwareentwickler",
				"company": "PTX tech",
				"date": "Nov 2021 - Nov 2022",
				"details": "Bei PTX habe ich an der Entwicklung eines fortschrittlichen Echtzeit-3D-Erkennungssystems mitgewirkt. Konkret habe ich eine effiziente, multithreaded Pipeline in C++ (Qt5-Framework) entworfen, um 3D-Punktwolken effektiv zu verarbeiten. Zudem habe ich einen GPU-beschleunigten SLAM-Algorithmus (Simultaneous Localization and Mapping) in das System integriert. Diese Integration führte zu einer etwa 10-fachen Beschleunigung der Verarbeitungszeit.",
				"urlLabel": "Besuche die Website von PTX",
				"url": "https://www.ptx-tech.de",
				"urlName": "ptx-tech.de",
				"type": "Arbeit"
			},
			{
				"title": "B.Sc. Informatik",
				"company": "Technische Universität Berlin",
				"date": "Okt 2020 - Apr 2024",
				"details": "Während meines Bachelorstudiums habe ich mir eine solide Grundlage in Programmierung, Algorithmen und Softwareentwicklung erarbeitet, mit Schwerpunkt auf der Lösung komplexer Probleme und effektiver Teamarbeit. In meiner Abschlussarbeit habe ich die Machbarkeit einer proaktiven Container-Migration in einer simulierten LEO-Edge-Umgebung (Low-Earth Orbit) untersucht. Die vollständige Arbeit sowie der Quellcode sind auf meinem GitHub verfügbar.",
				"urlLabel": "Besuche die Website der Universität",
				"url": "https://www.tu.berlin",
				"urlName": "tu.berlin",
				"type": "Bildung"
			},
			{
				"title": "Gymnasium",
				"company": "Gymnázium Ladislava Sáru, Bratislava",
				"date": "2012 - 2020",
				"details": "Ich besuchte ein allgemeinbildendes Gymnasium (vergleichbar mit dem Gymnasium in Deutschland) mit Schwerpunkt auf Sprachen (bei mir vor allem Deutsch). Ich schloss meine Schulzeit mit der Note 1,0 (beste mögliche Note) ab, wobei die Schwerpunkte Mathematik, Informatik, Englisch und Slowakisch lagen. Neben vielen schönen Erinnerungen erwarb ich auch eine solide Grundlage in den Naturwissenschaften sowie eine Einführung in die Programmierung. Außerdem lernte ich Deutsch und erwarb ein C1-Sprachzertifikat, das mir den Zugang zu den meisten Universitäten in Deutschland ermöglichte.",
				"urlLabel": "Schulwebsite (nur auf Slowakisch)",
				"url": "https://gymlsba.edupage.org/?lang=de",
				"urlName": "gymlsba.edupage.org",
				"type": "Bildung"
			}
		]
	},

	"contact": {
		"title": "Kontakt",
		"description": "Kontaktinformationen für Stanislav Kosorin, inklusive seiner E-Mail-Adresse und Telefonnummer",
		"linkedin": "Verbinde dich mit mir auf LinkedIn 🌍",
		"github": "Schau dir meine Projekte auf Github an 🐱‍💻",
		"email": "Schick mir eine E-Mail 📧"
	}
}
