{
	"about": {
		"title": "Stanislav Kosorin",
		"description": "Stránka o Stanislavovi Kosorinovi, opisujúca jeho pozadie, schopnosti a záujmy",
		"heading": "Vitaj!",
		"intro": "Volám sa Stano a som softvérový inžinier. Momentálne študujem masters informatiky na ",
		"tub": "Technickej univerzite v Berlíne",
		"cresta": {
			"intro": "Okrem štúdia pomáham firme ",
			"content": "Cresta",
			"outro": " transformovať call-centrá s pomocou AI. Konkrétne som full stack engineer, a pracujem hlavne s React-om, Go, a AWS."
		},
		"cv": {
			"intro": "Ak chceš vedieť viac o mojej doterajšej práci, pozri si môj ",
			"content": " životopis",
			"outro": "."
		},
		"projects": {
			"intro": "Taktiež mám za sebou viacero projektov, ako napríklad Google Summer of Code 2024. Tieto projekty nájdeš na ",
			"content": " stránke Projekty",
			"outro": "."
		},
		"sports": {
			"content": "Okrem programovania vo voľnom čase rád športujem. Rád chodím do posilky, behám a plávam. Tiež ma bavia jazyky, práve sa učím po perzsky a švédsky."
		}
	},
	"blog": {
		"title": "Blog",
		"description": "Blog Stanislav Kosorin, kde sa môžete dozvedieť viac o jeho záujmoch, zážitkoch a nápadoch",
		"heading": "Blog"
	},
	"cv": {
		"title": "Životopis",
		"description": "Interaktívny životopis Stanislava Kosorina, v ktorom sú popísané jeho vzdelanie, pracovné skúsenosti a zručnosti",
		"legend": {
			"prax": "Pracovné skúsenosti",
			"vzdelanie": "Vzdelanie",
			"project": "Osobný projekt"
		},
		"content": [
			{
				"title": "MSc Computer Science @ Technická univerzita v Berlíne",
				"date": "Apr 2024 - Present",
				"description": "Momentálne študujem masters informatiky so zameraním na distribuované systémy a siete.",
				"details": "Vyberám si predmety z oblasti distribuovaných systémov, počítačových sietí, cloud computing a security.",
				"urlLabel": "University website (MSc Informatika)",
				"url": "https://www.tu.berlin/en/studying/study-programs/all-programs-offered/study-course/computer-science-informatik-m-sc",
				"urlName": "tu.berlin",
				"type": "vzdelanie"
			},
			{
				"title": "Full Stack Software Engineer @ Cresta",
				"date": "Nov 2022 - súčasnosť",
				"description": "Ako full stack engineer pracujem s React a Typescript na frontendovej časti, Go na backendovej časti a gRPC na komunikáciu medzi microservices.",
				"details": "Okrem toho som získal solídne skúsenosti s cloud technológiami, najmä AWS, ako aj Infrastructure as Code pomocou Terraform.",
				"urlLabel": "Navštívte webovú stránku Cresta",
				"url": "https://www.cresta.com/",
				"urlName": "cresta.com",
				"type": "prax"
			},
			{
				"title": "Computer Vision Engineer @ PTX tech GmbH",
				"date": "Nov 2021 - Nov 2022",
				"description": "V spoločnosti PTX som prispel k vývoju state-of-the-art systému na 3D detekciu v reálnom čase s pomocou algoritmov počítačového videnia (computer vision). Tento projekt bol zrealizovaný s pomocou C++, Qt5 a Cuda.",
				"details": "Konkrétne som navrhol efektívnu viacvláknovú (multithreaded) pipeline v jazyku C++ (frameprax Qt5) na efektívne spracovanie 3D bodových oblakov (point clouds). Taktiež som integroval do systému GPU zrýchlený algoritmus Simultaneous Localization and Mapping (SLAM). Táto úspešná integrácia viedla k zrýchleniu spracovávania o 10-násobok a výrazne zlepšila celkový výkon nášho systému.",
				"urlLabel": "Webová stránka PTX",
				"url": "https://www.ptx-tech.de/",
				"urlName": "ptx-tech.de",
				"type": "prax"
			},
			{
				"title": "BSc Informatika @ Technická univerzita v Berlíne",
				"date": "Okt 2020 - Apr 2024",
				"description": "Získal som silné základy v oblasti softvérového inžinierstva, algoritmov a dátových štruktúr, počítačovej architektúry, sietí, distribuovaných systémov, systémového programovania, databáz a informačných systémov.",
				"details": "Téma mojej bakalárskej práce znela 'Evaluating the Feasibility of Container Migration on the LEO Edge'. Celá prax, vrátane zdrojáku je dostupná na mojom GitHube.",
				"urlLabel": "Stránka univerzity (Informatika)",
				"url": "https://www.tu.berlin/en/studying/study-programs/all-programs-offered/study-course/computer-science-b-sc",
				"urlName": "tu.berlin",
				"type": "vzdelanie"
			},
			{
				"title": "Gymnázium Ladislava Sáru, Bratislava",
				"date": "2012 - 2020",
				"description": "Navštevoval som všeobecné gymnázium s dôrazom na jazyky (u mňa nemčina). Na maturitnom vysvedčení som mal priemer 1, s predmetmi matematika, informatika, anglický a samozrejme slovenský jazyk.",
				"details": "Okrem super spomienok som získal široké všeobecné vzdelanie v prírodných vedách a naučil sa základy programovania. Taktiež som získal jazykový certifikát C1 z nemeckého jazyka, ktorý mi umožnil bez problémov pokračovať v štúdiu v Nemecku.",
				"urlLabel": "Stránka školy",
				"url": "https://gymlsba.edupage.org/?lang=en",
				"urlName": "gymlsba.edupage.org",
				"type": "vzdelanie"
			}
		]
	},
	"contact": {
		"title": "Kontakt",
		"description": "Kontakt na Stanislava Kosorina, jeho sociálne siete a email",
		"linkedin": "Spoj sa so mnou na LinkedIn 🌍",
		"github": "Pozri si moje projekty na GitHube 🐱‍💻",
		"email": "Pošli mi mail 📧"
	}
}
