{
	"about": {
		"title": "Stanislav Kosorin",
		"description": "The about page of Stanislav Kosorin, describing his background, skills, and interests",
		"heading": "Welcome!",
		"intro": "My name is Stan and I'm a software engineer. I'm currently pursuing a Master's degree in Computer Science at the ",
		"tub": "Technical University of Berlin",
		"cresta": {
			"intro": "Apart from studying, I'm helping ",
			"content": "Cresta",
			"outro": " revolutionize contact centers with AI. Specifically, I am a full stack engineer, working primarily with React, Go and AWS."
		},
		"cv": {
			"intro": "You can check out more of what I’ve been up to on my ",
			"content": "interactive resume",
			"outro": "."
		},
		"projects": {
			"intro": "I have worked on various projects, including Google Summer of Code 2024. You can find more info on the ",
			"content": "projects page",
			"outro": "."
		},
		"sports": {
			"content": "During my free time, I like to do sports, such as working out at the gym, running, or swimming. I also have a passion for learning languages, currently focusing on Persian and Swedish."
		}
	},
	"blog": {
		"title": "Blog",
		"description": "The personal blog of Stanislav Kosorin, including articles about programming, web development, and other topics",
		"heading": "Blog"
	},
	"cv": {
		"title": "Resume",
		"description": "An interactive resume of Stanislav Kosorin, outlining his education, work experience, and skills",
		"legend": {
			"work": "Work Experience",
			"education": "Education",
			"project": "Personal project"
		},
		"download": "Download PDF",
		"content": [
			{
				"title": "M.Sc. Computer Science",
				"company": "Technische Universität Berlin",
				"date": "Apr 2024 - Present",
				"details": "I'm currently pursuing a Master's degree with a focus on distributed systems, networking, databases, blockchain and software engineering. My expected graduation date is fall 2026.",
				"urlLabel": "Visit the university website",
				"url": "https://www.tu.berlin",
				"urlName": "tu.berlin",
				"type": "education"
			},
			{
				"title": "Software Engineer",
				"company": "Cresta",
				"date": "Nov 2022 - Present",
				"details": "At Cresta, I supported the development of data integrations and pipelines, across the frontend (React) and backend (Go). I gained a solid understanding of cloud technologies, particularly AWS, and Infrastructure as Code using Terraform. I also developed CI/CD pipelines using GitHub Actions and a custom E2E testing framework using Playwright.",
				"urlLabel": "Visit Cresta's website",
				"url": "https://www.cresta.com",
				"urlName": "cresta.com",
				"type": "work"
			},
			{
				"title": "Software Engineer",
				"company": "PTX tech",
				"date": "Nov 2021 - Nov 2022",
				"details": "At PTX, I contributed to the development of a cutting-edge, real-time 3D detection system. Specifically, I designed an efficient, multi-threaded pipeline in C++ (Qt5 framework) to process 3D point clouds effectively. I also integrated a GPU-accelerated Simultaneous Localization and Mapping (SLAM) algorithm into the system. This successful integration resulted in a ~10x speedup in processing time.",
				"urlLabel": "Visit PTX's website",
				"url": "https://www.ptx-tech.de",
				"urlName": "ptx-tech.de",
				"type": "work"
			},
			{
				"title": "B.Sc. Computer Science",
				"company": "Technische Universität Berlin",
				"date": "Oct 2020 - Apr 2024",
				"details": "During my bachelor studies, I gained a strong foundation in programming, algorithms, and software development, with a focus on solving complex problems and collaborating effectively in team environments. In my thesis, I explored the feasibility of proactive container migration on a simulated low-Earth orbit (LEO) edge environment. The entire thesis and source code are available on my GitHub.",
				"urlLabel": "Visit the university website",
				"url": "https://www.tu.berlin",
				"urlName": "tu.berlin",
				"type": "education"
			},
			{
				"title": "High School",
				"company": "Gymnázium Ladislava Sáru, Bratislava",
				"date": "2012 - 2020",
				"details": "I attended a general education high school (similar to Gymnasium in Germany), with a focus on languages (german in my case). I graduated with a 1.0 (best possible) grade on my final exam, with the focus subjects: mathematics, informatics, English and Slovak. In addition to forming some great memories, I gained a strong foundation in natural sciences as well as an introduction to programming. I also learned German and achieved a C1 language certificate, which was a free ticket to most universities in Germany.",
				"urlLabel": "School website (only in Slovak)",
				"url": "https://gymlsba.edupage.org/?lang=en",
				"urlName": "gymlsba.edupage.org",
				"type": "education"
			}
		]
	},
	"contact": {
		"title": "Contact",
		"description": "The contact page of Stanislav Kosorin, including his email address and social media profiles",
		"linkedin": "Connect with me on LinkedIn 🌍",
		"github": "Check out my projects on Github 🐱‍💻",
		"email": "Send me an email 📧"
	}
}
