{
	"about": {
		"title": "Stanislav Kosorin",
		"description": "The about page of Stanislav Kosorin, describing his background, skills, and interests",
		"heading": "Welcome!",
		"intro": "My name is Stan and I'm a software engineer. I'm currently pursuing a Master's degree in Computer Science at the ",
		"tub": "Technical University of Berlin",
		"cresta": {
			"intro": "Apart from studying, I'm helping ",
			"content": "Cresta",
			"outro": " revolutionize contact centers with AI. Specifically, I am a full stack engineer, working primarily with React, Go and AWS."
		},
		"cv": {
			"intro": "You can check out more of what I’ve been up to on my ",
			"content": "interactive resume",
			"outro": "."
		},
		"projects": {
			"intro": "I have worked on various projects, including Google Summer of Code 2024. You can find more info on the ",
			"content": "projects page",
			"outro": "."
		},
		"sports": {
			"content": "During my free time, I like to do sports, such as working out at the gym, running, or swimming. I also have a passion for learning languages, currently focusing on Persian and Swedish."
		}
	},
	"blog": {
		"title": "Blog",
		"description": "The personal blog of Stanislav Kosorin, including articles about programming, web development, and other topics",
		"heading": "Blog (English only)"
	},
	"cv": {
		"title": "Resume",
		"description": "An interactive resume of Stanislav Kosorin, outlining his education, work experience, and skills",
		"legend": {
			"work": "Work Experience",
			"education": "Education",
			"project": "Personal project"
		},
		"content": [
			{
				"title": "MSc Computer Science @ Technische Universität Berlin",
				"date": "Apr 2024 - Present",
				"description": "Currently pursuing a Master's degree with a focus on distributed systems and networking.",
				"details": "Topics include distributed systems, computer networks, cloud computing and security.",
				"urlLabel": "University website (CS)",
				"url": "https://www.tu.berlin/en/studying/study-programs/all-programs-offered/study-course/computer-science-informatik-m-sc",
				"urlName": "tu.berlin",
				"type": "education"
			},
			{
				"title": "Full Stack Software Engineer @ Cresta",
				"date": "Nov 2022 - Present",
				"description": "As a full stack software engineer, my primary responsibilities involve designing and implementing new features for our frontend web application using React with TypeScript, writing backend services in Go and working with gRPC for communication between microservices. ",
				"details": "I also gained a solid understanding of cloud technologies, particularly AWS, and have experience with infrastructure as code using Terraform.",
				"urlLabel": "Visit Cresta's website",
				"url": "https://www.cresta.com/",
				"urlName": "cresta.com",
				"type": "work"
			},
			{
				"title": "Computer Vision Engineer @ PTX tech GmbH",
				"date": "Nov 2021 - Nov 2022",
				"description": "At PTX, I contributed to the development of a cutting-edge, real-time 3D detection system that leveraged advanced computer vision algorithms. The languages and technologies used were C++, Qt5 and CUDA.",
				"details": "Specifically, I designed an efficient, multi-threaded pipeline in C++ (Qt5 framework) to process 3D point clouds effectively. I also integrated a GPU-accelerated Simultaneous Localization and Mapping (SLAM) algorithm into the system. This successful integration resulted in a 10x speedup in processing time, greatly enhancing the overall performance of our 3D detection system.",
				"urlLabel": "Visit PTX's website",
				"url": "https://www.ptx-tech.de/",
				"urlName": "ptx-tech.de",
				"type": "work"
			},
			{
				"title": "BSc Computer Science @ Technische Universität Berlin",
				"date": "Oct 2020 - Apr 2024",
				"description": "Gained a strong foundation in programming, algorithms, and software development, with a focus on solving complex problems and collaborating effectively in team environments. This education has prepared me to contribute meaningfully to technology-driven projects.",
				"details": "In my thesis, I explored the feasibility of proactive container migration on a simulated low-Earth (LEO) orbit edge environment. The entire thesis and source code are available on my GitHub.",
				"urlLabel": "University website (CS)",
				"url": "https://www.tu.berlin/en/studying/study-programs/all-programs-offered/study-course/computer-science-b-sc",
				"urlName": "tu.berlin",
				"type": "education"
			},
			{
				"title": "High School @ Gymnázium Ladislava Sáru, Bratislava",
				"date": "2012 - 2020",
				"description": "I attended a general education gymnasium, with a focus on languages (german in my case). I graduated with a 1.0 (best possible) grade on my final report, in the focus subjects mathematics, informatics, english and slovak language.",
				"details": "In addition to forming some great memories, I acquired a strong foundation in natural sciences as well as an introduction to programming. I also learned German and achieved a C1 language certificate, enabling me to pursue further studies in Germany.        ",
				"urlLabel": "School website (unfortunately only in Slovak)",
				"url": "https://gymlsba.edupage.org/?lang=en",
				"urlName": "gymlsba.edupage.org",
				"type": "education"
			}
		]
	},
	"contact": {
		"title": "Contact",
		"description": "The contact page of Stanislav Kosorin, including his email address and social media profiles",
		"linkedin": "Connect with me on LinkedIn 🌍",
		"github": "Check out my projects on Github 🐱‍💻",
		"email": "Send me an email 📧"
	}
}
