{
	"about": {
		"title": "Stanislav Kosorin",
		"description": "Om-sidan för Stanislav Kosorin, beskriver hans bakgrund, färdigheter och intressen",
		"heading": "Välkommen!",
		"intro": "Mitt namn är Stan och jag är mjukvaruingenjör. Jag studerar för närvarande en masterexamen i datavetenskap vid ",
		"tub": "Tekniska Universitetet i Berlin",
		"job": {
			"intro": "Jag gör för närvarande en praktik som Software Development Engineer (SDE) hos ",
			"content": "AWS",
			"outro": ", där jag jobbar med ett projekt i Simple Storage Service (S3)-teamet i Berlin."
		},
		"work": {
			"intro": "Du kan kolla in mer av vad jag har gjort på ",
			"content": "arbetssidan",
			"outro": "."
		},
		"projects": {
			"intro": "Jag har arbetat med olika projekt, inklusive Google Summer of Code 2024. Du kan hitta mer information på ",
			"content": "projektsidan",
			"outro": "."
		},
		"sports": {
			"content": "Under min fritid gillar jag att träna, springa eller simma. Jag har också ett intresse för att lära mig språk, och fokuserar för närvarande på persiska och svenska."
		}
	},
	"blog": {
		"title": "Blogg",
		"description": "Stanislav Kosorins blogg, där du kan lära dig mer om hans intressen, upplevelser och idéer",
		"heading": "Blogg"
	},
	"work": {
		"title": "Arbete",
		"description": "En interaktiv CV för Stanislav Kosorin, som beskriver hans utbildning, arbetslivserfarenhet och färdigheter",
		"download": "Ladda ner PDF",
		"content": [
			{
				"title": "Software Dev Engineer Intern",
				"company": "AWS",
				"date": "mar 2025 - sep 2025",
				"details": "Utvecklade ett EMR Cluster Core Capacity Prediction System för S3 Express One Zone Metering Service, deployat i produktionsregioner och minskade metering-kostnaderna med ca 65 %, samtidigt som cluster-runtimes förblev förutsägbara.",
				"urlLabel": "Besök S3 XOZ webbplats",
				"url": "https://aws.amazon.com/s3/storage-classes/express-one-zone/",
				"urlName": "aws.amazon.com/s3/storage-classes/express-one-zone/",
				"type": "work"
			},
			{
				"title": "Mjukvaruutvecklare",
				"company": "Cresta",
				"date": "nov 2022 - mar 2025",
				"details": "På Cresta bidrog jag till utvecklingen av dataintegrationer och pipelines, både för frontend (React) och backend (Go). Jag skaffade mig en god förståelse för molnteknologier, särskilt AWS, samt för Infrastructure as Code med Terraform. Jag utvecklade även CI/CD-pipelines med GitHub Actions och ett eget E2E-testframework med Playwright.",
				"urlLabel": "Besök Crestas webbplats",
				"url": "https://www.cresta.com",
				"urlName": "cresta.com",
				"type": "arbete"
			},
			{
				"title": "Mjukvaruutvecklare",
				"company": "PTX tech",
				"date": "nov 2021 - nov 2022",
				"details": "På PTX bidrog jag till utvecklingen av ett avancerat, realtids-3D-upptäcktsystem. Specifikt designade jag en effektiv, multitrådad pipeline i C++ (Qt5-ramverket) för att bearbeta 3D-punktmoln på ett effektivt sätt. Jag integrerade också en GPU-accelererad SLAM-algoritm (Simultaneous Localization and Mapping) i systemet. Denna integration resulterade i en ungefär 10-faldig ökning av bearbetningshastigheten.",
				"urlLabel": "Besök PTX:s webbplats",
				"url": "https://www.ptx-tech.de",
				"urlName": "ptx-tech.de",
				"type": "arbete"
			}
		]
	},
	"education": {
		"title": "Utbildning",
		"description": "En interaktiv CV för Stanislav Kosorin, som beskriver hans utbildning, arbetslivserfarenhet och färdigheter",
		"download": "Ladda ner PDF",
		"content": [
			{
				"title": "M.Sc. Datavetenskap",
				"company": "Technische Universität Berlin",
				"date": "apr 2024 - pågående",
				"details": "Jag studerar för närvarande en masterexamen med inriktning på distribuerade system, nätverk, databaser, blockchain och mjukvaruutveckling. Jag räknar med att ta examen hösten 2026.",
				"urlLabel": "Besök universitetets webbplats",
				"url": "https://www.tu.berlin",
				"urlName": "tu.berlin",
				"type": "utbildning"
			},
			{
				"title": "Kandidatuppsats: Containermigration på LEO Edge",
				"company": "TU Berlin",
				"date": "2024",
				"details": "I min kandidatuppsats undersökte jag möjligheten för proaktiv container-migration i en simulerad low-Earth orbit (LEO) edge-miljö. Jag utvecklade en anpassad migrationsstrategi och utvärderade dess prestanda vad gäller latens, genomströmning och resursutnyttjande. Uppsatsen och källkoden finns tillgängliga på min GitHub.",
				"urlLabel": "Kolla in repositoryn på GitHub",
				"url": "https://github.com/stano45/celestial-container-migration",
				"urlName": "github.com/stano45/celestial-container-migration",
				"type": "kandidatuppsatsprojekt"
			},
			{
				"title": "B.Sc. Datavetenskap",
				"company": "Technische Universität Berlin",
				"date": "okt 2020 - apr 2024",
				"details": "Under mina kandidatstudier fick jag en solid grund inom programmering, algoritmer och mjukvaruutveckling, med fokus på att lösa komplexa problem och samarbeta effektivt i team. I mitt examensarbete undersökte jag möjligheten till proaktiv container-migration i en simulerad LEO-edge-miljö (Low-Earth Orbit). Hela arbetet samt källkoden finns tillgänglig på min GitHub.",
				"urlLabel": "Besök universitetets webbplats",
				"url": "https://www.tu.berlin",
				"urlName": "tu.berlin",
				"type": "arbete"
			},
			{
				"title": "Gymnasium",
				"company": "Gymnázium Ladislava Sáru, Bratislava",
				"date": "2012 - 2020",
				"details": "Jag gick på en allmän gymnasieskola (liknande det tyska gymnasiet) med inriktning på språk (tyska i mitt fall). Jag tog studenten med betyget 1,0 (bästa möjliga) på slutprovet, med huvudämnena matematik, informatik, engelska och slovakiska. Förutom många fina minnen fick jag en gedigen grund inom naturvetenskap samt en introduktion till programmering. Jag lärde mig också tyska och erhöll ett C1-språkcertifikat, vilket var ett gratis inträde till de flesta universitet i Tyskland.",
				"urlLabel": "Skolans webbplats (endast på slovakiska)",
				"url": "https://gymlsba.edupage.org/?lang=en",
				"urlName": "gymlsba.edupage.org",
				"type": "utbildning"
			}
		]
	},
	"projects": {
		"title": "Projekt",
		"description": "Projektsidan av Stanislav Kosorin, som visar hans personliga och professionella projekt",
		"github": "Kolla in min GitHub-profil för fler projekt",
		"content": [
			{
				"title": "App för inlärning av slovakiska",
				"company": "LearnSlovak.sk",
				"date": "2025",
				"details": "Eftersom Duolingo inte erbjuder slovakiska bestämde jag mig för att skapa en egen app för att hjälpa min flickvän att lära sig språket enklare. Det är ett fullstack-projekt med ett Next.js-frontend och ett Python (Flask)-backend. Appen erbjuder flera lektioner och ett övningsläge.",
				"urlLabel": "Prova själv, det är helt gratis",
				"url": "https://learnslovak.sk",
				"urlName": "learnslovak.sk",
				"type": "personligt projekt"
			},
			{
				"title": "HEIC till JPEG-omvandlare i webbläsaren",
				"company": "heic2jpeg.eu",
				"date": "2025",
				"details": "Det här verktyget låter dig konvertera iPhone HEIC-bilder till JPEG direkt i din webbläsare, utan att ladda upp dina filer till en server. Jag skapade det eftersom de befintliga verktygen antingen inte tillät batchkonvertering eller krävde att bilder laddades upp till en tredjepartsserver.",
				"urlLabel": "Prova det själv",
				"url": "https://heic2jpeg.eu",
				"urlName": "heic2jpeg.eu",
				"type": "personligt projekt"
			},
			{
				"title": "Google Summer of Code",
				"company": "P4 Language Consortium",
				"date": "2024",
				"details": "Detta projekt med P4 Language Consortium syftar till att integrera P4-baserad lastbalansering i Kubernetes-ekosystemet. Jag utvecklade ett anpassat CNI-plugin som dynamiskt konfigurerar en BMv2-mjukvaruväxel för att lastbalansera trafiken under en container-migration mellan pods. Jag håller för närvarande på att köra experiment med en Tofino 2-växel och testar i ett Kubernetes-kluster med flera noder, allt tack vare INET-laboratoriet vid TU Berlin.",
				"urlLabel": "Kolla in repositoryn på GitHub",
				"url": "https://github.com/stano45/p4containerflow",
				"urlName": "github.com/stano45/p4containerflow",
				"type": "GSoC-projekt"
			},
			{
				"title": "Chrome-tillägg för visualisering av nätverkstrafik",
				"company": "net-mapper",
				"date": "2024",
				"details": "net-mapper är ett Chrome-tillägg som visualiserar de globala destinationerna för din internettrafik. Tillägget loggar IP-adresserna för alla servrar som din webbläsare kommunicerar med och visar dem på en interaktiv karta, så att du kan se de fysiska platserna för servrarna som hostar de webbplatser du besöker. Tyvärr är tillägget inte tillgängligt i Chrome Web Store på grund av stora ändringar i tilläggsbehörigheterna, men om du är intresserad kan du kolla in källkoden och köra det lokalt.",
				"urlLabel": "Kolla in repositoryn på GitHub",
				"url": "https://github.com/stano45/net-mapper",
				"urlName": "github.com/stano45/net-mapper",
				"type": "personligt projekt"
			},
			{
				"title": "Portfolio-webbplats",
				"company": "kosorin.com",
				"date": "2023",
				"details": "Det är den du tittar på just nu! Jag byggde den här webbplatsen från grunden med React, Next.js och Tailwind CSS. Den exporteras statiskt via Next.js och hostas av GitHub Pages.",
				"urlLabel": "Kolla in repositoryn på GitHub",
				"url": "https://github.com/stano45/stano45.github.io",
				"urlName": "github.com/stano45/stano45.github.io",
				"type": "personligt projekt"
			},
			{
				"title": "Rust-mikrotjänstekodgenerator",
				"company": "TU Berlin",
				"date": "2023",
				"details": "Crustagen är en Rust-kodgenerator som tar AsyncAPI-specifikationer som indata och genererar Rust-kod tillsammans med alla nödvändiga beroenden och automatiskt genererad dokumentation. Den är designad för att vara ett effektivt verktyg för att konvertera AsyncAPI-specifikationer till Rust-projekt som är redo att byggas och köras.",
				"urlLabel": "Kolla in repositoryn på GitHub",
				"url": "https://github.com/Programmierpraktikum-MVA/AsyncAPI",
				"urlName": "github.com/Programmierpraktikum-MVA/AsyncAPI",
				"type": "universitetsprojekt"
			},
			{
				"title": "Distribuerad nyckel-värdeslagring i Rust",
				"company": "hit-or-miss",
				"date": "2023",
				"details": "hit-or-miss är en distribuerad nyckel-värdeslagring som använder en master-slave-arkitektur. Slaven väljs med hjälp av en konsekvent hash-algoritm, och mastern ansvarar för replikering och felupptäckt. Projektet är skrivet i Rust och använder Tokio-runtime för asynkrona I/O-operationer. Detta är inte ett produktionsklart system, utan snarare ett lärande projekt för att förstå distribuerade system och Rust.",
				"urlLabel": "Kolla in repositoryn på GitHub",
				"url": "https://github.com/stano45/hit-or-miss",
				"urlName": "github.com/stano45/hit-or-miss",
				"type": "personligt projekt"
			}
		]
	},
	"contact": {
		"title": "Kontakt",
		"description": "Kontaktinformation för Stanislav Kosorin, hans sociala nätverk och e-post",
		"linkedin": "Anslut till mig på LinkedIn 🌍",
		"github": "Kolla in mina projekt på Github 🐱‍💻",
		"email": "Skicka mig ett e-postmeddelande 📧"
	}
}
